soap/createGoodsBody.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wms="http://npl-dev.omnic.solutions/wms">
   <soap:Header/>
   <soap:Body>
      <wms:CreateUpdateGoods>
         <wms:Organization>NPL_A1</wms:Organization>
         <wms:Goods>
            <wms:MessageGoods>
               <wms:Sku>100330</wms:Sku>
               <wms:GoodsUnitName>Акумулятор Eve MB30 330AH</wms:GoodsUnitName>
               <wms:GoodsUnitFullName>Акумулятор Eve MB30 330AH</wms:GoodsUnitFullName>
               <wms:BaseMeasureUnit>
                  <wms:BarCode></wms:BarCode>
                  <wms:MeasureUnitName>уп.</wms:MeasureUnitName>
                  <wms:Weight>24</wms:Weight>
                  <wms:Length>30</wms:Length>
                  <wms:Height>30</wms:Height>
                  <wms:Width>40</wms:Width>
               </wms:BaseMeasureUnit>
               <wms:ExpirationDateSign>0</wms:ExpirationDateSign>
               <wms:Price>3697</wms:Price>
            </wms:MessageGoods>
         </wms:Goods>
      </wms:CreateUpdateGoods>
   </soap:Body>
</soap:Envelope>
